import PySimpleGUI as sg
import random as rd

names = [
    "佐藤", "鈴木", "高橋", "田中", "渡辺",
    "小林", "山本", "伊藤", "山田", "斎藤",
    "中村", "加藤", "吉田", "山口", "松本",
    "井上", "森田", "青木", "坂本", "池田",
    "佐々木", "林", "石川", "前田", "小川",
    "吉川", "柴田", "安藤", "岡田", "河野",
    "堀田", "福田", "大塚", "杉山", "高田",
    "村上", "杉本", "木村", "中島", "三浦",
    "竹内", "藤田", "小野", "松田", "酒井",
    "川口", "長谷川", "須藤", "藤原", "藤本",
    "中川", "横山", "永井", "山内", "栗原",
    "田村", "西村", "岡本", "古川", "宮崎",
    "桜井", "宮本", "金子", "清水", "小島",
    "篠原", "関口", "西田", "平野", "森本",
    "望月", "高木", "千葉", "水野", "阿部",
    "永田", "福島", "桑原", "荒木", "神田",
    "馬場", "矢野", "内田", "鶴田", "梅田",
    "小笠原", "松井", "島田", "大西", "福井",
    "沢田", "加藤", "今井", "矢田", "亀田",
    "筒井", "酒井", "西川","和田"
]

alphabet = [
"シンクロニシティ","プレミアム","プライマリー","ヴィジュアル","プログレッシブ",
"ファンダメンタル","エコノミクス","シンプル","アナログ","デジタル",
"フォトジェニック","コンセプチュアル","アカデミック","リアルタイム","サステナビリティ",
"ユートピア","ダイナミック","グローバル","ローカル","イノベーティブ",
"クリエイティブ","オーセンティック","エキゾチック","サスペンスフル","マジェスティック",
"スタイリッシュ","エレガント","サービス","ファーストクラス","ブランディング",
"コミュニケーション","アイデンティティ","ビジネス","フィナンシャル","デジタル",
"テクノロジー","プラットフォーム","イノベーション","アドバイザリー","エグゼクティブ",
"マネジメント","リーダーシップ","カルチャー","マインドセット","ビジョン",
"ミッション","ストラテジー","プロセス","デザイン","プロトタイプ",
"ユーザーインターフェース","ユーザーエクスペリエンス","フィードバック","バリデーション","マーケティング",
"ブランドポジショニング","メッセージング","コンテンツストラテジー","キャンペーン","ソーシャルメディア",
"デジタルストラテジー","プロダクトマーケティング","モバイルマーケティング","アフィリエイトマーケティング","コンテンツマーケティング",
"メールマーケティング","リテンションマーケティング","カスタマーエクスペリエンス","カスタマーサポート","カスタマーサクセス",
"カスタマーアドボカシー","リレーションシップマーケティング","コーポレートコミュニケーション","パブリックリレーションズ","インフルエンサーマーケティング",
"デジタルプロモーション","エキスパートサービス","プロフェッショナルサービ","アキコ"
]

layout =[[sg.Button("実行",key="-submit-",size = (50,3))],
        [sg.Output(size = (50,20),key = "-output-")]
]

window = sg.Window("Name_Maker!",layout,size = (400,600))

while True:
    event, values = window.read()
    if event == "-submit-":
        window["-output-"].update("")
        name = rd.choice(alphabet) + rd.choice(names) 
        print(name)
    if event== sg.WIN_CLOSED:
        break
