"""
using modules
"""
from random import choice
import PySimpleGUI as sg


NAMES = [
    "佐藤", "鈴木", "高橋", "田中", "伊藤", "渡辺", "山本", "中村", "小林",
    "加藤", "吉田", "山田", "佐々木", "山口", "松本", "井上", "木村", "林", "斎藤", "清水",
    "山崎", "森", "池田", "橋本", "阿部", "石山", "山下", "中島", "石井",
    "小川", "前田", "岡田", "長谷川", "藤田", "後藤", "近藤", "村上", "遠藤", "青木", "坂本",
    "斉藤", "福田", "太田", "西田", "藤井", "金子", "岡本", "藤原", "中の",
    "三浦", "原田", "中川", "松田", "竹内", "小野", "田村", "中山", "和田", "石田", "森田",
    "上田", "原", "内田", "柴田", "酒井", "宮崎", "横山", "高木", "安藤", "宮本",
    "大野", "小島", "谷口", "今井", "工藤", "高田", "増田", "丸山", "杉山", "村田",
    "大塚", "新井", "小山", "平野", "藤本", "河野", "上野", "野口", "武田", "松井",
    "千葉", "岩崎", "菅原", "木下", "久保", "佐野", "野村", "松尾", "市川", "菊池",
    "杉本", "古川", "島田", "大西", "水野", "桜井", "高野", "吉川", "渡部",
    "山内", "飯田", "西田", "小松", "北村", "安田", "五十嵐", "川口", "関", "菊池", "西川",
    "平田", "中田", "久保田", "服部", "東", "岩田", "土屋", "河崎", "福島", "本田",
    "辻", "樋口", "秋山", "長井", "田口", "山中", "中西", "吉村", "川上", "石原",
    "大橋", "松岡", "馬場", "浜田", "森本", "星の", "朝野", "矢野", "大久保",
    "松下", "小池", "吉岡", "野田", "荒木", "大谷", "内藤", "松浦", "熊谷", "黒田", "尾崎",
    "永田", "望月", "川村", "田辺", "荒井", "松村", "堀", "大島", "早川", "平井",
    "栗原", "菅野", "西山", "広瀬", "横田", "石橋", "小泉", "大森", "成田", "南",
    "萩原", "岩本", "片山", "関口", "宮田", "大石", "高山", "吉野", "本間", "須藤",
    "岡崎", "小田", "伊東", "鎌田", "上原", "篠原", "尾西", "松原", "福井", "古賀",
    "奥村", "内山", "川島", "沢田", "桑原", "三宅", "片岡", "杉浦", "富田", "丘",
    "八木", "奥田", "小沢", "松永", "北山", "関根", "河合", "平山", "牧野", "白石",
    "今村", "寺田", "青山", "中尾", "小倉", "渋谷", "上村", "小野寺", "大山", "足立",
    "岡村", "坂口", "天野", "多田", "佐久間", "根本", "豊田", "田島", "飯塚", "角田",
    "村山", "武藤", "白井", "西", "武田", "宮本", "榎本", "塚本", "神谷", "坂田",
    "水谷", "児玉", "坂井", "齋藤", "浅井", "小原", "岡部", "森下", "神田", "小笠原",
    "中井", "植田", "河村", "宮川", "稲垣", "前川", "大川", "松崎", "中田", "若林",
    "飯島", "谷", "大沢", "石塚", "安部", "堀内", "及川", "田代", "中嶋", "江口",
    "山根", "中谷", "岸本", "荒川", "本多", "森山", "丘野", "金井", "細川",
    "今野", "戸田", "稲葉", "安達", "津田", "森川", "落合", "土井", "村松", "星", "町田",
    "三上", "畠山", "岩井", "長尾", "堤", "中原", "野崎", "中沢", "金田",
    "米田", "松山", "杉田", "堀田", "西野", "三好", "山岸", "佐伯", "黒川", "西岡", "大竹",
    "泉", "甲斐", "大木", "笠原", "堀江", "岸", "川田", "徳永", "須田",
    "黒木", "山川", "古田", "榊原", "梅田", "新田", "三木", "野中", "大城", "村井", "大竹",
    "金城", "奥山", "土田", "滝沢", "川端", "井口", "梶原", "大場", "宮城", "比嘉",
    "長島", "吉原", "宮内", "金沢", "安井", "庄司", "大内", "茂木", "大村", "萩野",
    "日高", "松島", "向井", "下田", "塚田", "石黒", "西本", "奥野", "竹中", "広田",
    "嶋田", "栗田", "藤川", "福本", "北野", "藤野", "宇野", "川原", "丹羽", "谷川",
    "尾谷", "青柳", "吉本", "藤岡", "竹下", "竹本", "古岡", "緒方", "藤村", "平川",
    "亀井", "高島", "三輪", "篠崎", "藤沢", "窪田", "宮原", "根岸", "高井", "下村",
    "高瀬", "山村", "川本", "柳沢", "小澤", "横井", "吉沢", "出口", "武井", "小森",
    "武村", "長野", "宮沢", "志村", "平松", "臼井", "福岡", "黒沢", "溝口", "田原",
    "稲田", "浅田", "奥村", "永野", "大原", "冨田", "林田", "瀬戸", "大平", "手塚",
    "入江", "篠田", "福永", "北原", "富永", "矢島", "小出", "湯浅", "鶴田", "沼田",
    "高松", "堀口", "筒井", "柳田", "長岡", "岩瀬", "山岡", "大田", "石崎", "澤田",
    "大槻", "石山", "池上", "堀川", "二宮", "相場", "園田", "柏木", "島崎", "奥田",
    "平岡", "花田", "杉原", "加納", "村瀬", "川野", "内海", "片桐", "長沢", "倉田",
    "野沢", "河原", "福原", "秋元", "越智", "西原", "松野", "笠井", "尾坂", "田畑",
    "北島", "渡邊", "日野", "谷本", "千田", "吉井", "深沢", "西沢", "相沢", "徳田",
    "原口", "小柳", "米山", "細谷", "田上", "新谷", "今泉", "酢が", "浜野", "森岡",
    "畑中", "小嶋", "磯部", "大井", "秋田", "芳賀", "浅見", "相原", "坪井", "細田",
    "植木", "萩原", "大崎", "白川", "皆川", "中本", "岸田", "三谷", "福山", "平林",
    "辻本", "浜口", "川瀬", "島村", "畑", "木原", "大友", "塩田", "河内", "遠山",
    "古谷", "神山", "中里", "齋藤", "三橋", "三井", "大澤", "大坪", "植村", "難波",
    "三村", "渡邊", "栗山", "岩下", "松川", "井手", "吉永", "早坂", "井出", "長井",
    "川畑", "佐竹", "朝倉", "柳", "亀山", "河田", "川合", "橘", "浜崎", "草野",
    "小宮", "堀井", "保坂", "志賀", "中根", "尾形", "半田", "村岡", "狩野", "新垣",
    "水上", "高村", "大津", "高柳", "若松", "柴崎", "亀田", "高岡", "立石", "市村",
    "玉城", "寺島", "中野", "三島", "瀬川", "武内", "奈良", "藤崎", "木内", "平",
    "久野", "植松", "清野", "真鍋", "玉井", "深谷", "水口", "江藤", "大沼", "進藤",
    "並木", "守屋", "寺本", "橋口", "高見", "菅谷", "宮地", "織田", "藤森", "河本",
    "毛利", "宮島", "石渡", "大江", "矢部", "市原", "有馬", "下山", "高原", "有田",
    "那須", "鳥居", "飯野", "関谷", "松沢", "北山", "坂下", "野上", "板垣", "前原",
    "牧","三原", "川井", "坂上", "染谷", "田崎", "立花", "外山", "平尾", "岩佐",
    "松木", "小室", "成瀬", "三田", "高尾", "長谷", "坂本", "葛西", "山城", "宇佐美",
    "野本", "滝本", "秋葉", "長瀬", "板倉", "高崎", "塚原", "小寺", "山崎", "滝口",
    "仲村", "石垣", "高梨", "山野", "井田", "長谷部", "秦", "江崎", "海野", "大倉",
    "門脇", "椎名", "和泉", "正木", "土居", "中澤", "相川", "今田", "都築", "平塚",
    "小関", "奥", "藤木", "細井", "島", "宍戸", "堀越", "江川", "小杉", "岩永", "木田",
    "西谷", "金谷", "諏訪", "金山", "乾", "永山", "森谷", "田川", "石丸",
    "下川", "金森", "細野", "黒岩", "大熊", "大貫", "野原", "布施", "小畑", "島袋",
    "杉村", "北田", "小野田", "梅原", "山上", "富樫", "大矢", "上山", "阿久津", "豊島",
    "赤松", "石本", "本橋", "宮脇", "米沢", "末永", "宮野", "倉持", "古沢", "奥野",
    "塩谷", "今西", "麻生", "仲田", "菅沼", "風間", "水田", "平良", "香川", "生田",
    "小幡", "坂元", "大庭", "小久保", "喜多", "門田", "西口", "須賀", "井川",
    "大和田", "中林", "奥山", "富岡", "梅本", "海老原", "永島", "浦田", "矢口", "佐川", "岩間",
    "杉野", "砂川", "川辺", "土橋", "浜本", "木本", "木戸", "日下", "岩渕", "波多野",
    "大滝", "長崎", "金丸", "雨宮", "立川", "羽田", "小沼", "白鳥", "依田", "浅川",
    "平沢", "真田", "小椋", "石坂", "神崎", "阪橋", "目黒", "深田", "森脇", "山形",
    "宇田川", "濱田", "寺尾", "大畑", "曽根", "矢田", "三枝", "松元", "山元", "影山",
    "北沢", "高倉", "勝又", "清田", "橋爪", "柳川", "赤木", "梅津", "鶴岡", "芦田",
    "丹野", "櫻井", "瀬尾", "尾上", "宇都宮", "岩城", "江原", "神野", "横尾", "吉澤",
    "坂野", "柳原", "池内", "桑田", "西脇", "久米", "日比野", "栗林", "梅村", "角",
    "結城", "小堀", "西島", "小菅", "手島", "大嶋", "浦野", "川西", "森口", "飛田",
    "井原", "上杉", "小高", "田端", "首藤", "赤坂", "玉置", "青野", "横川", "柏原",
    "北", "浅沼", "大林", "梅沢", "水島", "小玉", "合田", "宮坂", "角谷", "有賀",
    "竹原", "脇田", "宮里", "柴山", "本村", "三沢", "島津", "池本", "志田", "明石",
    "加瀬", "池谷", "春日", "勝田", "妹尾", "滝川", "大和", "富士", "大下", "前島",
    "楠", "中塚", "会田", "柿沼", "恩田", "坂口", "戸塚", "石野", "夏目", "磯野",
    "前野", "益田", "曽我", "古山", "野島", "笹川", "小栗", "白木", "谷村", "吉崎",
    "菅井", "川越", "国分", "楠木", "坂東", "日下部", "井本", "岡山", "内村", "持田",
    "花岡", "高畑", "熊田", "中", "金澤", "鬼頭", "神戸", "末吉", "沖", "石倉",
    "福地", "田渕", "城戸", "玉木", "滝", "浜", "倉本", "田所", "東海林", "児島",
    "塩見", "粕谷", "沖田", "寺沢", "森井", "黒崎", "八田", "沢井", "重松", "寺西",
    "高嶋", "長坂", "廣瀬", "森永", "本山", "重田", "村木", "大浦", "深井", "大高",
    "高谷", "井村", "田尻", "鵜飼", "南部", "知念", "平賀", "玉田", "川嶋", "磯崎",
    "菊田", "今", "米倉", "秋本", "岡島", "寺岡", "熊倉", "猪股", "笹原", "小俣",
    "岩谷", "畠中", "古橋", "冨永", "氏家", "下地", "桜田", "富沢", "長浜", "五味",
    "岩谷", "増井", "小口", "野呂", "小暮", "小平", "大関", "川添", "紺野", "梶田",
    "平本", "土谷", "花井", "牧田", "西井", "安永", "新村", "西浦", "鹿島", "杉崎"
]

ALPHABET = [
    "テック", "マトリックス", "インパクト", "コスモス", "クオンタム", "ノヴァ", "フュージョン", "スペクトラム",
    "エボリューション", "ベロシティ", "グラビティ", "インフィニティ", "ホライズン", "フュージョン", "イクイノックス",
    "カオス", "イクリプス", "ジェネシス", "レーザー", "ネオン", "ギャラクシー", "ミラージュ", "ネビュラ",
    "タイタン", "オメガ", "サイバー", "ファントム", "ゼニス", "アストラ", "ヘリックス", "ノヴァ",
    "ブレイズ", "ブレード", "ステルス", "ハイパー", "エレクトラ", "ソレス", "アクセル", "チェイス",
    "アストロ", "ボルト", "プロトン", "エレメント", "スープラ", "フュージョン", "エイペックス", "サンダー",
    "フレア", "イグナイト", "ボルテックス", "ブースト", "エアロ", "コズミック", "ボルテックス", "シャドウ",
    "ハイペリオン", "オリオン", "エクソダス", "イグナイト", "ストラトス", "テンペスト", "ビクトリー",
    "ゼファー", "ゼニス", "ホライズン", "ネオン", "スペクトラム", "スーパーノヴァ", "ノヴァ",
    "キセノン", "ユーフォリア", "アポロ", "ラプター", "ブリッツ", "ネビュラ", "コスモ", "イクリプス",
    "インフィニティ", "ジーロット", "アストラル", "レディアンス", "オーロラ", "インフェルノ", "フュージョン",
    "ネクサス", "オムニ", "ポラリス", "リバーブ", "エアロ", "ジェネシス", "ハイパーノヴァ", "ビスタ",
    "ダイナモ", "プラズマ", "グラビトン", "シグマ", "リミックス", "デルタ", "インセプション", "オリジン",
    "フラッシュ", "サイレンス", "プライム", "フリクション", "ヴァイパー", "シンクロニシティ", "プレミアム", "プライマリー", "ヴィジュアル", "プログレッシブ",
    "ファンダメンタル", "エコノミクス", "シンプル", "アナログ", "デジタル",
    "フォトジェニック", "コンセプチュアル", "アカデミック", "リアルタイム", "サステナビリティ",
    "ユートピア", "ダイナミック", "グローバル", "ローカル", "イノベーティブ",
    "クリエイティブ", "オーセンティック", "エキゾチック", "サスペンスフル", "マジェスティック",
    "スタイリッシュ", "エレガント", "サービス", "ファーストクラス", "ブランディング",
    "コミュニケーション", "アイデンティティ", "ビジネス", "フィナンシャル", "デジタル",
    "テクノロジー", "プラットフォーム", "イノベーション", "アドバイザリー", "エグゼクティブ",
    "マネジメント", "リーダーシップ", "カルチャー", "マインドセット", "ビジョン",
    "ミッション", "ストラテジー", "プロセス", "デザイン", "プロトタイプ",
    "ユーザーインターフェース", "ユーザーエクスペリエンス", "フィードバック", "バリデーション", "マーケティング",
    "ブランドポジショニング", "メッセージング", "コンテンツストラテジー", "キャンペーン", "ソーシャルメディア",
    "デジタルストラテジー", "プロダクトマーケティング", "モバイルマーケティング", "アフィリエイトマーケティング", "コンテンツマーケティング",
    "メールマーケティング", "リテンションマーケティング", "カスタマーエクスペリエンス", "カスタマーサポート", "カスタマーサクセス",
    "カスタマーアドボカシー", "リレーションシップマーケティング", "コーポレートコミュニケーション", "パブリックリレーションズ", "インフルエンサーマーケティング",
    "デジタルプロモーション", "エキスパートサービス", "プロフェッショナルサービ"   
]

layout =[
        [sg.Button("実行",key="-submit-",size = (50,3))],
        [sg.Output(size = (50,12),key = "-output-")],
        [sg.Button("10回実行",key="-tensubmit-",size = (50,3))],
        [sg.Output(size = (50,12),key = "-tenoutput-")]
]

window = sg.Window("Name_Maker!",layout,resizable=True,size = (400,600))


while True:
    event,values = window.read()
    match event:
        case "-submit-":
            window["-output-"].update("")
            name = choice(ALPHABET) + choice(NAMES)
            window["-output-"].update(name)
        case "-tensubmit-":
            window["-tenoutput-"].update("")
            for i in range(10):
                name = choice(ALPHABET) + choice(NAMES)
                print(name)
        case sg.WIN_CLOSED:
            break
